; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v6 - type_1 ?v8 - type_2)
 	      (pred_1 ?v5 - object ?v8 - type_2)
	      (pred_4 ?v6 - type_1 ?v2 - type_3)
	      (pred_2 ?v6 - type_1 ?v5 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v6 - type_1 ?v3 ?v1 - type_2)
       :precondition (and  (pred_3 ?v6 ?v3))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_1 ?v4 - object ?v7 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v7) (pred_3 ?v6 ?v7) (pred_4 ?v6 ?v2))
       :effect (and (pred_2 ?v6 ?v4 ?v2)
		    (not (pred_1 ?v4 ?v7)) 
		    (not (pred_4 ?v6 ?v2))))

   (:action op_2
       :parameters (?v6 - type_1 ?v4 - object ?v7 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v4 ?v2) (pred_3 ?v6 ?v7))
       :effect (and (pred_1 ?v4 ?v7)
		    (pred_4 ?v6 ?v2)
		    (not (pred_2 ?v6 ?v4 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_1
obj_03 obj_01 - type_3
obj_04 obj_02 obj_06 - type_2
obj_08 obj_05 obj_07 - object)
(:init
(pred_3 obj_09 obj_02)
(pred_4 obj_09 obj_03)
(pred_4 obj_09 obj_01)
(pred_1 obj_08 obj_02)
(pred_1 obj_05 obj_02)
(pred_1 obj_07 obj_04)
)
(:goal
(and
(pred_1 obj_08 obj_06)
(pred_1 obj_05 obj_06)
(pred_1 obj_07 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_09 ?b obj_03))))
)
)

; plan
1. (op_1 obj_09 obj_05 obj_02 obj_01)
   deleted: (pred_1 obj_05 obj_02) (pred_4 obj_09 obj_01)
   added: (pred_2 obj_09 obj_05 obj_01)
   goals met: 1 of 3
2. (op_3 obj_09 obj_02 obj_06)
   deleted: (pred_3 obj_09 obj_02)
   added: (pred_3 obj_09 obj_06)
   goals met: 1 of 3
3. (op_2 obj_09 obj_05 obj_06 obj_01)
   deleted: (pred_2 obj_09 obj_05 obj_01)
   added: (pred_1 obj_05 obj_06) (pred_4 obj_09 obj_01)
   goals met: 2 of 3
4. (op_3 obj_09 obj_06 obj_02)
   deleted: (pred_3 obj_09 obj_06)
   added: (pred_3 obj_09 obj_02)
   goals met: 2 of 3
5. (op_1 obj_09 obj_08 obj_02 obj_01)
   deleted: (pred_1 obj_08 obj_02) (pred_4 obj_09 obj_01)
   added: (pred_2 obj_09 obj_08 obj_01)
   goals met: 2 of 3
6. (op_3 obj_09 obj_02 obj_06)
   deleted: (pred_3 obj_09 obj_02)
   added: (pred_3 obj_09 obj_06)
   goals met: 2 of 3
7. (op_2 obj_09 obj_08 obj_06 obj_01)
   deleted: (pred_2 obj_09 obj_08 obj_01)
   added: (pred_1 obj_08 obj_06) (pred_4 obj_09 obj_01)
   goals met: 3 of 3
